# Pandas Dataframe ê³¼ Series

In [8]:
import pandas as pd

In [9]:
# pd.Series(['banana',42])
pd.Series(['banana',42],index =['name','age'],name = 'kind')

name    banana
age         42
Name: kind, dtype: object

In [11]:
pd.DataFrame({
    'Name':['Framklin','Gosset'],
    'Born':['1920-07-25','1876-06-03'],
    'Age':['37','61']
})

       Name        Born Age
0  Framklin  1920-07-25  37
1    Gosset  1876-06-03  61

In [13]:
pd.DataFrame([[1,2,3,],[4,5,6],[7,8,9]],
             columns = ['a','b','c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
df = pd.read_csv('data/scientists.csv')
df.head(2)

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician

In [20]:
df.tail(2)

           Name        Born        Died  Age          Occupation
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician